Процедура ОбновитьСписокВалют() Экспорт
	
	//https://api.coinmarketcap.com/v1/ticker/	
	uriПространстваИмен = "https://api.coinmarketcap.com";
	команда = "ticker";
	
	сервер = "api.coinmarketcap.com";
	ресурс = "/v1/" + команда + "/";
	параметрыКоманды = "limit=10";
	
	соединение = Новый HTTPСоединение(сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	ресурсПараметры = ресурс+"?"+параметрыКоманды;
	
	запрос = Новый HTTPЗапрос(ресурсПараметры);
	
	
	ответСервера = Соединение.Получить(запрос);
	
	Сообщить(ответСервера.КодСостояния);
	
	
	чтениеJSON = Новый ЧтениеJSON;
	чтениеJSON.УстановитьСтроку(ответСервера.ПолучитьТелоКакСтроку());
	
	объектXDTO = ФабрикаXDTO.ПрочитатьJSON(чтениеJSON, ФабрикаXDTO.Тип(uriПространстваИмен, "TickerResponse"));
	
	
	НачатьТранзакцию();
	
	Для Каждого инструмент Из объектXDTO.Tickers Цикл
		
		id = инструмент.id;
		
		сВалюты = Справочники.Валюты.НайтиПоРеквизиту("id", id);
		
		Если сВалюты.Пустая() Тогда
			оВалюты = Справочники.Валюты.СоздатьЭлемент();
		Иначе
			оВалюты = сВалюты.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(оВалюты, инструмент, "id,symbol,rank");
		
		оВалюты.Наименование = инструмент.name;
		
		Если ПроверкаДанныхСервер.ОбъектИзменён(оВалюты) Тогда
			оВалюты.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры